{"pageProps":{"post":{"title":"Compiling Source SDK on Linux","date":"2019-08-17","slug":"2019-08-17-source-sdk-linux","content":"<p>The Source SDK is a fork of Valve's internal Perforce repository containing the application code they use to build Valve's games based on the Source 1 engine. Games such as Counter Strike: Source, Team Fortress 2 and Half-Life 2.</p>\n<hr>\n<p>The SDK <a href=\"https://github.com/ValveSoftware/source-sdk-2013/\">available on Github</a> is primarily based on <a href=\"https://en.wikipedia.org/wiki/Half-Life_2\">Half-life 2</a>, while other games are removed from the repository before they are exported to Github.</p>\n<p>Link to Github: https://github.com/ValveSoftware/source-sdk-2013/</p>\n<p>The Source SDK is comprised of multiple projects that are shared libraries which are referenced by a proprietary engine created by Valve. The Engine and some of its surrounding tools are not open source and while source code can be found on the internet, usage is not legal and is covered under both copyright and DMCA.</p>\n<p>The <a href=\"https://github.com/ValveSoftware/source-sdk-2013/blob/master/LICENSE\">Valve Source SDK license</a> makes it clear that the shared libraries are the property of Valve and while they may be freely used, there are some limitations that make them different from typical GPL and BSD licenses that we have become accustomed to. Namely that the application created cannot be used for commercial purposes.</p>\n<h3>Why would you want to use the Source SDK?</h3>\n<p>The Source SDK is rather interesting, because there quite a few successful commercial games based on the platform. The platform is rather rich in features, though it may not be the most intuitive platform to use. The tooling and artwork pipeline lacks in areas that make it difficult for an artist to use. The artistic pipeline is primarily centered around proprietary file formats designed specifically for the Source Engine and command-line utilities that must be used to cover files between supported non-commercial formats and Valve's proprietary Source Engine formats.</p>\n<p>Overall, the Source SDK can be interesting, because it is based on Half-life 2 and contains a fully featured version of Half-life 2 within it. This can give a basis for building a prototype or game top of the existing Half-life 2 series without needing to create everything from scratch. Of course Source is used to create many other games and contains abstractions that make it easy to move away from the look and feel of Half-life. Adding player functionality, weapons and game entities is completely within the scope of creating a game based on the Source SDK.</p>\n<h3>Compiling on Linux</h3>\n<p>Now, because much of the Source SDK and the engine are proprietary. There is not much of a booming open source community as one would expect with some of this caliber of quality. Namely, because of a lack of updates, communication and being partially limited due its proprietary nature.</p>\n<p>The Source Engine and SDK support Windows, macOS and Linux, but due to its closed sourced libraries compilation can be rather tricky. In this post I will show the easiest way to get started compiling the Source SDK on Linux.</p>\n<p>The easiest way to compile the Source SDK on Linux is to use <a href=\"https://www.docker.com\">Docker</a> and an image of <a href=\"http://releases.ubuntu.com/14.04/\">Ubuntu 14.04</a>. The reasoning is because the proprietary libraries that the SDK must be linked against were built using the shared libraries and version of GCC found in Ubuntu 14.04.</p>\n<pre><code>cd ~\ngit clone git@github.com:ValveSoftware/source-sdk-2013.git\n\nsudo docker run -t -i -v $(pwd):$(pwd) ubuntu:14.04 /bin/bash\nsudo apt-get update &#x26;&#x26; sudo apt-get install -y gcc-multilib g++-multilib build-essential rsync\n\n# In docker instance\n\n# Change to the directory of the source-sdk-2013\ncd &#x3C;folder>/mp/src\n\n# Create the Makefiles required for compilation\n./createallprojects\n\n# Compile the mod by running Make\nmake -f everything.mak\n\n# Copy the binary files to your mod folder\nrsync --progress -v ../game/mod_hl2mp/bin/* &#x3C;path-to-home>/.steam/steam/steamapps/sourcemods/my-source-mod/bin/\n</code></pre>\n<h3>Other Tooling on Linux</h3>\n<p>Much of the Source SDK tooling is created for Windows only and does not execute on macOS or Linux. The solution is rather typical. Use Wine which supports most Source SDK tools rather reliably.</p>\n<p>For model editing, the native version of <a href=\"https://www.blender.org/download/\">Blender 2.8x</a> can <a href=\"https://developer.valvesoftware.com/wiki/Blender_Source_Tools\">be used</a> with the <a href=\"http://steamreview.org/BlenderSourceTools/\">Blender Source Tools</a>.</p>\n<p>For mapping the included <a href=\"https://developer.valvesoftware.com/wiki/Valve_Hammer_Editor\">Hammer</a> can be used] by installing the <a href=\"https://developer.valvesoftware.com/wiki/Source_SDK_2013\">Source Base 2013 Single Player</a> installed with the Windows compatibility layer. Launch <code>Hammer.exe</code> using wine from the bin directory.</p>\n<p>For texture compilation, the <a href=\"\">tga2vtf.exe</a> command-line application can be used via Wine.</p>\n<h3>Conclusion</h3>\n<p>Using the Source SDK on Linux is feasible, although rather time consuming and sometimes unintuitive. It is more difficult to extend the platform due to the closed source nature. Had the Engine and SDK been fully open source and developed as an open source project in tandem with the surrounding community there would be a remarkable improvement in productivity and community support. Hopefully future versions of the Source 2 Engine will be developed directly on Github with developers allowing for complete open usage of their game engine.</p>\n<p>Never the less, anyone interested in game development should take a look at the Source SDK if only for a view into how commercial games were developed in past. The Source SDK is a piece of history in game engine and tool development that has many lessons to offer.</p>\n"}},"__N_SSG":true}