{"pageProps":{"post":{"title":"Play 2.0 with Intellij","date":"2012-06-25","slug":"2012-06-25-scala-intellij","content":"<p>After upgrading to Windows 8, I noticed some stability issues with Eclipse Juno. Many of the problems made Juno completely unusable on my installation.</p>\n<hr>\n<p>While downloading the older version of <a href=\"http://www.eclipse.org/indigo/\">Eclipse (Indigo)</a>, I decided to also give <a href=\"http://www.jetbrains.com/idea/download/\">Idea Intelij</a> community edition a try.</p>\n<h2>Setup the project</h2>\n<p>Setting up the project is really easy with the \"play\" command.</p>\n<p>Simply add the play framework to your $PATH or %PATH% (as you probably already have) and type: <code>play idea</code>\nin your project folder. This should create an Intelij project that you can later import.</p>\n<h3>Download Intelij</h3>\n<p>Download the community edition of Intelij from here: <a href=\"http://www.jetbrains.com/idea/download/\">http://www.jetbrains.com/idea/download/</a></p>\n<h2>Setup Scala Support</h2>\n<h3>Scala Plugin</h3>\n<p>The Scala plugin can be installed by clicking <em>File->Settings->Plugins->\"Browse Repositories...\".</em> After the installation of this plugin, everything should be ready for developing your Play 2.0 Scala application.</p>\n<h3>Play 2.0 Plugin (Not recommended)</h3>\n<p>There is a Play 2.0 plugin for Intelij that has nightly builds here:</p>\n<p><a href=\"http://confluence.jetbrains.net/display/SCA/Play+2.0+plugin+Nightly+Builds+for+Leda\">http://confluence.jetbrains.net/display/SCA/Play+2.0+plugin+Nightly+Builds+for+Leda</a></p>\n<p>It is still in the early stages of development.</p>\n<h2>What I noticed</h2>\n<p>I noticed the Scala support is very stable and auto complete works more often than not. The IDE seems a lot more cohesive and easier to use than Eclipse. The UI is well thought out.</p>\n<p>Performance on my desktop machine is where Intelij is not the best. I changed some of the theming options and disabled unneeded plugins. Fortunately that fixed many of the performance issues, but it's not as fast as Eclipse Juno. This is not a big deal though, because the rest of the IDE makes up for it.</p>\n<p>Overall, I'm happy with Intelij and will begin to consider using it more often in other projects.</p>\n"}},"__N_SSG":true}