{"pageProps":{"post":{"title":"Windows 8 Review","date":"2012-10-28","slug":"2012-10-28-windows-8-review","content":"<p>Been using Windows 8 for a little over 3 weeks now.</p>\n<hr>\n<p>I have to say, that this OS has been easier to use and has had less problems than Windows 7. I've already become accustomed to the workflows and cannot really find many faults (besides the fact that it's not *nix based).</p>\n<p>That being said, I have not used any metro applications and will probably not use any metro applications for the foreseeable future. I do not believe metro is a viable direction for desktops.</p>\n<p>However, it's very easy to forget that Windows 8 even has metro applications and just use the operating system like previous versions of Windows would be used. With the exception of the start menu, the Desktop mode in Windows 8 is nearly identicial to Windows 7. Being one that has not used the start menu in many years, I do not see this as a fault or issue.</p>\n<p>I will review Windows 8, like I would review any Linux distribution.</p>\n<h3>Performance (5/5)</h3>\n<p><strong>Pros</strong><br>\nThe fastest desktop operating system I have ever used.</p>\n<p><strong>Cons</strong><br>\nN/A</p>\n<h3>Stability (5/5)</h3>\n<p><strong>Pros</strong><br>\nThe most stable operating system I have ever used. Not a single problem has occurred since the installation on my desktop (my laptop is another story though).</p>\n<p><strong>Cons</strong><br>\nN/A</p>\n<h3>Packaging (5/5)</h3>\n<p><strong>Pros</strong><br>\nThis is where most Linux distributions fall flat on their face. I don't have this problem on Windows. For unix applications, I have installed Gnutils, Cygwin and Mingw. This has covered all my needs so far and I haven't found a reason to use a full Linux installation. If I do need a full installation, then I can setup a headless virtualbox with a very light weight Arch Linux install and SSH into it.</p>\n<p><strong>Cons</strong><br>\nN/A</p>\n<h3>Installation (4/5)</h3>\n<p><strong>Pros</strong><br>\nWindows 8 has the same installation procedure that Windows 7 has. It's a decent installer and gets out of the way. The installer has a far better UI and procedure than Ubuntu or Fedora.</p>\n<p><strong>Cons</strong><br>\nIt deletes the MBR and there's no easy way to stop that from happening.</p>\n<p><strong>UI (3/5):</strong></p>\n<p><strong>Pros</strong></p>\n<div class=\"tab\">The polish and attention to detail has not been seen before in other versions of Windows. The OS has some decent keyboard shortcuts too. I find that metro can be largely ignored. The start screen is simply that, a start screen. It functions better and is faster than the old start menu. It makes more sense.</div>\n<p><strong>Cons</strong><br>\nThere is the jarring effect of having metro and the classical desktop. Windows has never been strong in the UI department (but this is an improvement over Windows 7).</p>\n<h3>Final Words</h3>\n<p>Windows 8 is the best desktop operating system I have ever used. I'd also go as far to say it's the best. There is a lot FUD being spread around about Windows 8, but it doesn't really hold up.</p>\n<p>There's no certainty that Microsoft can keep this up though, but I hope they continue to make improvements to the classical desktop and keep it alive. Metro doesn't cut it for daily desktop usage.</p>\n"}},"__N_SSG":true}